# Створiть 3 рiзних функцiї (на ваш вибiр). Кожна з цих функцiй повинна повертати якийсь
# результат. Також створiть четверу ф-цiю, яка в тiлi викликає 3 попереднi, обробляє
# повернутий ними результат та також повертає результат. Таким чином ми будемо викликати 1 функцiю,
# а вона в своєму тiлi ще 3
def fun_1():
    return 'fun_1 done'


def fun_2():
    return 'fun_2 done'


def fun_3():
    return 'fun_3 done'


def together_fun():
    a = fun_1()
    b = fun_2()
    c = fun_3()
    return a, b, c

print(together_fun())
