# Написати функцію, яка приймає два параметри: ім'я файлу та кількість символів.
#    На екран повинен вивестись список із трьома блоками - символи з початку, із середини та з кінця файлу.
#    Кількість символів в блоках - та, яка введена в другому параметрі.
#    Придумайте самі, як обробляти помилку, наприклад, коли кількість символів більша, ніж є в файлі
#    (наприклад, файл із двох символів і треба вивести по одному символу, то що виводити на місці середнього блоку символів?)
#    В репозиторій додайте і ті файли, по яким робили тести.
#    Як визначати середину файлу (з якої брать необхідні символи) - кількість символів поділити навпіл, а отримане
#    "вікно" символів відцентрувати щодо середини файла і взяти необхідну кількість. В разі необхідності заокруглення одного чи обох параметрів
#    - дивіться на свій розсуд.
def function(file_name, number):
    with open(file_name, 'r+') as f:
        for row in f:
            start = row[:int(number)]
            print(f'Start elements in string {start}')
            len_str = len(row)
            step_1 = len_str//2 - number - number//2
            index_center = number+step_1
            center = row[index_center:-index_center]
            print(f'Center elements in string {center}')
            finish = row[-number:]
            print(f'Finish elements in string {finish}')
            if len_str//2 < number:
                raise Exception('Number more string')


function('file.txt', 3)